const data = {
  statename: "गोंय सरकार",
  deptname: "नियोजन,सांख्यिकी आनी मूल्यमापन संचालनालय",
  birthcertificate: "जल्म प्रमाणपत्र",
  name: "नांव",
  sex: "लिंग",
  dob: "जल्म तारीख",
  pob: "जल्मस्थान",
  nom: "आवयचें नांव",
  nof: "बापायचें नांव",
  nogf: "आजोबाचें नांव(बापायची बाजू)",
  nogm: "आजीचें नांव(बापायची बाजू)",
  address: "नामो",
  regno: "नोंदणी क्रमांक",
  dor: "नोंदणी करपाची तारीख",
  doi: "जारी करपाची तारीख",
  soi: "जारी करपी प्राधिकरणाची स्वाक्षरी",
  aoi: "जारी करपी प्राधिकरणाचे पत्तो",
  cr: "मुखेल निबंधक",
  fs: "फॅक्सी स्वाक्षरी करप",
};

export default data;
