const data = {
  statename: "गोंय सरकार",
  deptname: "नियोजन,सांख्यिकी आनी मूल्यमापन संचालनालय",
  deathcertificate: "मरण प्रमाणपत्र",
  name: "नांव",
  sex: "लिंग",
  dod: "मरणाची तारीख",
  pod: "मरणाची सुवात",
  nom: "आवयचें नांव",
  nof: "बापायचें नांव",
  paddress: "कायम स्वरुपाचो पत्तो",
  addressAtDeath: "मरणा वेळार पत्तो",
  regno: "नोंदणी क्रमांक",
  reasonofdeath: "मरणाचे कारण",
  dor: "नोंदणी करपाची तारीख",
  doi: "जारी करपाची तारीख",
  soi: "जारी करपी प्राधिकरणाची स्वाक्षरी",
  aoi: "जारी करपी प्राधिकरणाचे पत्तो",
  cr: "मुखेल निबंधक",
  fs: "फॅक्सी स्वाक्षरी करप",
};

export default data;
