{
  "data": [
    {
      "name": "Next Js",
      "info": "The React Framework for Production built together with Google and Facebook.Next.js gives you the best developer experience with all the features you need for production: hybrid static & server rendering, TypeScript support, smart bundling, route pre-fetching, and more. Next.js powers the biggest websites like Patreon, for use cases in e-commerce, travel, news, and marketing. No config needed. Next.js has all the tools you need to make the Web. Faster."
    },
    {
      "name": "Redux",
      "info": "Redux helps you write applications that behave consistently, run in different environments (client, server, and native), and are easy to test.Redux solves this problem by managing application's state with a single global object called Store. Redux fundamental principles help in maintaining consistency throughout your application, which makes debugging and testing easier. Reducers are functions that take the current state and an action as arguments, and return a new state result."
    },
    {
      "name": "Cloudinary",
      "info": "Cloudinary is an end-to-end image- and video-management solution for websites and mobile apps, covering everything from image and video uploads, storage, manipulations, optimizations to delivery.With Cloudinary, you can easily upload images and videos to the cloud and automate smart manipulations of those media without installing any other software. Cloudinary then seamlessly delivers your media through a fast content delivery network (CDN), optimized with the industry’s best practices.Additionally, Cloudinary offers comprehensive APIs and administration capabilities, which you can easily integrate with your web and mobile apps."
    },
    {
      "name": "Mongoose",
      "info": "Mongoose is an Object Data Modeling (ODM) library for MongoDB and Node.js. It manages relationships between data, provides schema validation, and is used to translate between objects in code and the representation of those objects in MongoDB."
    },
    {
      "name": "Formik",
      "info": "Formik is a small group of React components and hooks for building forms in React and React Native."
    },
    {
      "name": "Yup",
      "info": "Yup is a JavaScript schema builder for value parsing and validation. Define a schema, transform a value to match, validate the shape of an existing value, or both. Yup schemas are extremely expressive and allow modeling complex, interdependent validations, or value transformations."
    },
    {
      "name": "Axios",
      "info": "Axios is a promise based HTTP client for the browser and Node.js. Axios makes it easy to send asynchronous HTTP requests to REST endpoints and perform CRUD operations. It can be used in plain JavaScript or with a library such as Vue or React."
    },
    {
      "name": "Vercel",
      "info": "Vercel (formerly known as ZEIT) is a cloud platform that enables developers to host websites and web services that deploy instantly, scale automatically, and require no supervision.Vercel is also a parent company of the Next.js framework. Vercel is the best place to deploy any frontend app. Start by deploying with zero configuration to our global edge network. Scale dynamically to millions of pages without breaking a sweat.The Vercel platform makes it a collaborative experience with deploy previews for every code change, by seamlessly integrating with GitHub, GitLab, and Bitbucket. It also handles SSL certification."
    },
    {
      "name": "Solidity",
      "info": "Solidity is a brand-new programming language created by Ethereum which is the second-largest market of cryptocurrency by capitalization, released in the year 2015 led by Christian Reitwiessner. Solidity is a high-level programming language designed for implementing smart contracts.It is a statically-typed object-oriented(contract-oriented) language.Solidity supports complex user-defined programming, libraries and inheritance.Solidity is the primary language for blockchains running platforms. Solidity can be used to create contracts like voting, blind auctions, crowdfunding, multi-signature wallets, etc"
    },
    {
      "name": "Ethereum",
      "info": "Ethereum is a decentralized open-source platform based on the blockchain domain, used to run smart contracts i.e. applications that execute the program exactly as it was programmed without the possibility of any fraud, interference from a third party, censorship, or downtime. It serves a platform for nearly 2,60,000 different cryptocurrencies. Ether is a cryptocurrency generated by ethereum miners, used to reward for the computations performed to secure the blockchain."
    },
    {
      "name": "Truffle",
      "info": "A world class development environment, testing framework and asset pipeline for blockchains using the Ethereum Virtual Machine (EVM), aiming to make life as a developer easier. Truffle is clearly a smart contract development environment. This environment has several wonderful features that benefit dApp developers a lot. Truffle is the ecosystem's development, asset pipeline, and testing framework. Truffle is a popular Ethereum dApp development framework with a significant community. Also, Truffle uses the EVM as a foundation and aims to make smart contract creation easier and more accessible."
    },
    {
      "name": "Ganache",
      "info": "A personal blockchain for Ethereum development you can use to deploy contracts, develop your applications, and run tests. It is available as both a desktop application as well as a command-line tool (formerly known as the TestRPC). Ganache is available for Windows, Mac, and Linux. Ganache is a tool for creating a local Ethereum blockchain. The blockchain may be used in all stages of development, making it very beneficial. As we set up our local blockchain, Ganache helps us to safely install, create, and test our dApps. We should use a local blockchain while designing applications for two reasons. First, we can save money, and second, we can save time.Uploading contracts to an authoritative chain like Ethereum mainnet costs gas. This can be problematic because of the high and unpredictable fees. As a result, uploading contracts that are still not operating might be quite costly."
    },
    {
      "name": "Infura",
      "info": "Infura is a blockchain development suite that provides application programming interfaces (APIs) and developer tools. Moreover, Infura provides fast and reliable access to the Ethereum network to enable developers to build sophisticated next-generation software and Web3 applications that scale to meet user demand."
    },
    {
      "name": "Metamask",
      "info": "MetaMask is a browser plugin that serves as an Ethereum wallet, and is installed like any other browser plugin. Once it's installed, it allows users to store Ether and other ERC-20 tokens, enabling them to transact with any Ethereum address.The ERC-20 token standard allows developers to create their own tokens on the Ethereum network. It has provided an easier route for companies to develop blockchain products instead of building their own cryptocurrency."
    },
    {
      "name": "Web3.Storage",
      "info": "Web3.Storage, a simple interface for developers to store and retrieve data from Filecoin’s decentralized storage network! Web3.Storage: which will remain free indefinitely gives developers an easy avenue to build applications with redundant, decentralized storage and secure, content addressed data."
    },
    {
      "name": "Rinkeby network",
      "info": "Rinkeby is an Ethereum testnet (or test network). Testnets are typically used by developers to run tests for their application or software. Currency on testnet is valueless. Rinkeby testnet, unlike Ethereum mainnet, is a proof-of-authority network, as opposed to a proof-of-work network like Ethereum mainnet."
    },
    {
      "name": "Rinkeby Faucet",
      "info": "An Ethereum faucet is a developer tool to get testnet Ether (ETH) in order to test and troubleshoot your decentralized application or protocol before going live on Ethereum mainnet, where one must use real Ether. Most faucets require social authentication (e.g. Twitter post or login confirming you are a real human) or place you in a queue to wait for a testnet token through the faucet. The Alchemy Rinkeby faucet is free, fast, and does not require authentication, though you can optionally login to Alchemy to get an increased drip."
    }
  ]
}
